

#include <stdio.h>
#include<conio.h>
#include<stdlib.h>

#define GYO  10
#define RETU 10

//迷路データ
int meiro[GYO][RETU] = {
    {1,1,1,1,1,1,1,1,1,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,0,0,0,0,0,0,0,0,1,},
    {1,1,1,1,1,1,1,1,1,1,},
};

int px, py;		/* プレイヤーのxy座標 */
int goal_count;	/* 塗りつぶすべき床の数 */
int count;		/* 塗りつぶした床の数 */

int main()
{
    
}
